
## :white_check_mark: Apply Succeeded (client-api-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/55526)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 4 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
aws_security_group.memcached_elasticache_security_group_B1576B6B: Refreshing state... [id=sg-0930b4e2f05364b95]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Refreshing state... [id=clientapi-dev]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_caller_identity.caller: Reading...
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-clientapi-dev-synthetic-checks]
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/ClientAPI-Dev/ecs/aws-otel-collector]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z01176122IDS22ERDQURR]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1756567564]
data.aws_region.region: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=clientapi-dev-app]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=1a82bb9a-8bfd-46f0-8fed-e64049bec4bb:ClientAPI-Dev-ECS]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C: Refreshing state... [id=clientapi-dev-elasticachesubnetgroup]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ClientAPI-Dev/ecs/app]
data.aws_kms_alias.kms_alias: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/ClientAPI-Dev]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/982cc9b0-96ca-4ab6-926a-4d3fedd21550]
aws_acm_certificate.application_cdn_certificate_E17B2815: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/f3c4f1ca-d3e5-47e2-a84a-bf19d9db2993]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Read complete after 0s [id=pocket-data-items-dev]
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-clientapi-dev-synthetic-check]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/ClientAPI-Dev-TaskRolePolicy]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ClientAPI-Dev-ECSCodeDeployRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ClientAPI-Dev-TaskRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ClientAPI-Dev-TaskExecutionRole]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=ZCSIDA846KWLN]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=2823607138]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=clientapi-dev-app]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/5f64d2eeb0f137974291414a7440c7385418086c]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-clientapi-dev-synthetic-checks]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=2027868515]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_client-api.getpocket.dev_NS]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/ClientAPI-Dev-TaskExecutionRolePolicy]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=capi-dev-uptime-0]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::410318598490:policy/pocket-clientapi-dev-synthetic-check-access]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z01176122IDS22ERDQURR__0ab1a0be63c1d4a4f211102bb0bc6162.direct.client-api.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ClientAPI-Dev-TaskRole-20240109012408902800000002]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ClientAPI-Dev-ECSCodeDeployRole-20240109010425399300000008]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ClientAPI-Dev-TaskExecutionRole-20240109012408939000000003]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ClientAPI-Dev]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Refreshing state... [id=Z01176122IDS22ERDQURR__36eeea28b7e96de4b44d914af2e10180.client-api.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ClientAPI-Dev-TaskExecutionRole-20240109012408963100000004]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/CAPIgr20240109010424184400000006/eb77c9168594c715]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/CAPIbl20240109010422632000000004/00c2578c407aae66]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-017f81cf4050df5df]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-clientapi-dev-synthetic-check-20240109012409040700000005]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2024-01-09 01:05:41.337 +0000 UTC]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Refreshing state... [id=capi-dev-uptime-0]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=16c7301fcab0b3acb171e2ee9e0adfda100ebe7c]
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-01627271717942503]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/CAPI20240109010425432200000009/84092bc7b056b564]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/CAPI20240109010425432200000009/84092bc7b056b564/4cf5adc61089f1b2]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z01176122IDS22ERDQURR_direct.client-api.getpocket.dev_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/CAPI20240109010425432200000009/84092bc7b056b564/a6044fb3894087c6]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=ClientAPI-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Refreshing state... [id=ClientAPI-Dev-Alarm-HTTPResponseTime]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Refreshing state... [id=E2FAT8VMGPNC7E]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/CAPI20240109010425432200000009/84092bc7b056b564/a6044fb3894087c6/5a0fec510b276ecd]
aws_route53_record.application_cdn_record_B2BBECBB: Refreshing state... [id=Z01176122IDS22ERDQURR_client-api.getpocket.dev_A_2]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/ClientAPI-Dev/ClientAPI-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ClientAPI-Dev/ClientAPI-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ClientAPI-Dev]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=73e2e3fd-f4ec-4b57-997e-4cdef7df9302]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ClientAPI-Dev-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ClientAPI-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ClientAPI-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ClientAPI-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/ClientAPI-Dev:84" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/ClientAPI-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "PORT"
                            value = "4001"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "4a52fb01178e61b1ac264d94b31d668c4f9379b9" -> "4d1194717d2c0591edc95e1dd2a0881e9ab45fec"
                        },
                    ]
                  ~ image                  = "410318598490.dkr.ecr.us-east-1.amazonaws.com/clientapi-dev-app:4a52fb01178e61b1ac264d94b31d668c4f9379b9" -> "410318598490.dkr.ecr.us-east-1.amazonaws.com/clientapi-dev-app:4d1194717d2c0591edc95e1dd2a0881e9ab45fec"
                    name                   = "app"
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ClientAPI-Dev" -> (known after apply)
      ~ revision                 = 84 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "ClientAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9 will be destroyed
  # (because aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9 is not in configuration)
  - resource "aws_elasticache_cluster" "memcached_elasticache_cluster_3C71B9D9" {
      - apply_immediately          = true -> null
      - arn                        = "arn:aws:elasticache:us-east-1:410318598490:cluster:clientapi-dev" -> null
      - auto_minor_version_upgrade = "true" -> null
      - availability_zone          = "us-east-1e" -> null
      - az_mode                    = "single-az" -> null
      - cache_nodes                = [
          - {
              - address           = "clientapi-dev.n7e2yl.0001.use1.cache.amazonaws.com"
              - availability_zone = "us-east-1e"
              - id                = "0001"
              - outpost_arn       = ""
              - port              = 11211
            },
          - {
              - address           = "clientapi-dev.n7e2yl.0002.use1.cache.amazonaws.com"
              - availability_zone = "us-east-1e"
              - id                = "0002"
              - outpost_arn       = ""
              - port              = 11211
            },
        ] -> null
      - cluster_address            = "clientapi-dev.n7e2yl.cfg.use1.cache.amazonaws.com" -> null
      - cluster_id                 = "clientapi-dev" -> null
      - configuration_endpoint     = "clientapi-dev.n7e2yl.cfg.use1.cache.amazonaws.com:11211" -> null
      - engine                     = "memcached" -> null
      - engine_version             = "1.6.6" -> null
      - engine_version_actual      = "1.6.6" -> null
      - id                         = "clientapi-dev" -> null
      - ip_discovery               = "ipv4" -> null
      - maintenance_window         = "thu:06:00-thu:07:00" -> null
      - network_type               = "ipv4" -> null
      - node_type                  = "cache.t3.micro" -> null
      - num_cache_nodes            = 2 -> null
      - parameter_group_name       = "default.memcached1.6" -> null
      - port                       = 11211 -> null
      - security_group_ids         = [
          - "sg-0930b4e2f05364b95",
        ] -> null
      - snapshot_retention_limit   = 0 -> null
      - subnet_group_name          = "clientapi-dev-elasticachesubnetgroup" -> null
      - tags                       = {
          - "environment" = "Dev"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all                   = {
          - "environment" = "Dev"
          - "service"     = "ClientAPI"
        } -> null
      - transit_encryption_enabled = false -> null
    }

  # aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C will be destroyed
  # (because aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C is not in configuration)
  - resource "aws_elasticache_subnet_group" "memcached_elasticache_subnet_group_F45C696C" {
      - arn         = "arn:aws:elasticache:us-east-1:410318598490:subnetgroup:clientapi-dev-elasticachesubnetgroup" -> null
      - description = "Managed by Terraform" -> null
      - id          = "clientapi-dev-elasticachesubnetgroup" -> null
      - name        = "clientapi-dev-elasticachesubnetgroup" -> null
      - subnet_ids  = [
          - "subnet-04478ac1c55709b1f",
          - "subnet-07854aac95d07bb16",
          - "subnet-0a6c00fa564f97b10",
          - "subnet-0eb99fe10e08d5d96",
        ] -> null
      - tags        = {
          - "environment" = "Dev"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all    = {
          - "environment" = "Dev"
          - "service"     = "ClientAPI"
        } -> null
    }

  # aws_security_group.memcached_elasticache_security_group_B1576B6B will be destroyed
  # (because aws_security_group.memcached_elasticache_security_group_B1576B6B is not in configuration)
  - resource "aws_security_group" "memcached_elasticache_security_group_B1576B6B" {
      - arn                    = "arn:aws:ec2:us-east-1:410318598490:security-group/sg-0930b4e2f05364b95" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0930b4e2f05364b95" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = ""
              - from_port        = 11211
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 11211
            },
        ] -> null
      - name                   = "ClientAPI-Dev20240124202528518600000001" -> null
      - name_prefix            = "ClientAPI-Dev" -> null
      - owner_id               = "410318598490" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "environment" = "Dev"
          - "service"     = "ClientAPI"
        } -> null
      - tags_all               = {
          - "environment" = "Dev"
          - "service"     = "ClientAPI"
        } -> null
      - vpc_id                 = "vpc-012481e83ffa5e152" -> null
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 4 to destroy.
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Destroying... [id=clientapi-dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ClientAPI-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ClientAPI-Dev]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=1953f6b6cea3c8a34513f1f15870bc4887a717af]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 10s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 20s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 30s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 40s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 50s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 1m0s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 1m10s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 1m20s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 1m30s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 1m40s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 1m50s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 2m0s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 2m10s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 2m20s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 2m30s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 2m40s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 2m50s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 3m0s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 3m10s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 3m20s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 3m30s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 3m40s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 3m50s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 4m0s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 4m10s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 4m20s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 4m30s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 4m40s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Still destroying... [id=clientapi-dev, 4m50s elapsed]
aws_elasticache_cluster.memcached_elasticache_cluster_3C71B9D9: Destruction complete after 4m52s
aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C: Destroying... [id=clientapi-dev-elasticachesubnetgroup]
aws_security_group.memcached_elasticache_security_group_B1576B6B: Destroying... [id=sg-0930b4e2f05364b95]
aws_elasticache_subnet_group.memcached_elasticache_subnet_group_F45C696C: Destruction complete after 1s
aws_security_group.memcached_elasticache_security_group_B1576B6B: Destruction complete after 1s

Apply complete! Resources: 2 added, 0 changed, 4 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"149c23ed-1546-405c-9e64-b22d60ed6452","JobName":"client-api_infrastructure_apply_dev","PRNumber":195,"Program":"tfcmt","SHA1":"4d1194717d2c0591edc95e1dd2a0881e9ab45fec","Target":"client-api-cdk-dev","Vars":{}} -->